Revit 2022 API
AnalyticalModelSurface.HasOpenings Method
 Checks if the analytical model surface have any openings.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2013
Syntax
C#
public bool HasOpenings()
Visual Basic
Public Function HasOpenings As Boolean
Visual C++
public:
bool HasOpenings()
Return Value
 True if Analytical Surface Element contains any openings (included invalid for hide).
See Also
AnalyticalModelSurface Class
Autodesk.Revit.DB.Structure Namespace